# RvtLinkInstanceProjectInformation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RvtLinkInstanceProjectInformation Property
ParameterTypeId Class See Also
---
"Project Information"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RvtLinkInstanceProjectInformation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RvtLinkInstanceProjectInformation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RvtLinkInstanceProjectInformation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace